<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"99a46ca059bf8fd9420fe05acd34cf78f44352e5991f380f193d66009e172d96","plan_job_ref":"Job Validations on PR #15 at https://github.com/SelfOverflow/discord-bots/actions/runs/22022396296","plan_out_hash":"412ae9dad85eef5501daca57f5b6bc7dc4022a252945c8b0735ca94806864557","plan_hash":"92a4a8f64f087017b52e0da42ba8f3cb456080a556e24e447828e484b800df93","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "ap-south-1"
+       tags                                 = {
+           "Name" = "main"
        }
+       tags_all                             = {
+           "Name" = "main"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Post merge deploy to production #4](https://github.com/SelfOverflow/discord-bots/actions/runs/22022415746)